jeremyfuksa/kerchunk-kiosk/firmware/m1-feasibility/sdkconfig.defaults
# Target: ESP32-S3-DevKitC-1 (N8R2 — 8 MB flash, 2 MB PSRAM on-module;
# vision targets N8R8 in production but DevKitC-1 ships N8R2).
CONFIG_IDF_TARGET="esp32s3"

# PSRAM — required for I/Q ring buffer.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# Flash — 8 MB on DevKitC-1.
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"

# CPU at full clock for DSP headroom checks.
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# USB OTG host — required for RTL-SDR bulk transfer.
CONFIG_USB_HOST_ENABLED=y
